3A/CS341/Dynamic-Programming-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-11 Mon 23:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dynamic Programming Part 3</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Dynamic Programming Part 3</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbdcd2f4">1. Edit Distance</a>
<ul>
<li><a href="#org50e5beb">1.1. Recurrence</a></li>
</ul>
</li>
<li><a href="#orgc50e6ed">2. Optimal Binary Search Trees</a>
<ul>
<li><a href="#org4331ee8">2.1. Recurrence</a></li>
<li><a href="#org44bacfb">2.2. Algorithm</a></li>
</ul>
</li>
<li><a href="#org08fc897">3. Independent Sets in Trees</a>
<ul>
<li><a href="#orgf5dad69">3.1. Algorithm</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbdcd2f4" class="outline-2">
<h2 id="orgbdcd2f4"><span class="section-number-2">1.</span> Edit Distance</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Input</b>: arrays of characters \(A\) and \(B\) of length \(n\) and \(m\) respectively
</p>

<p>
<b>Output</b>:minimum number of add, delete, or change operations that turn \(A\) into \(B\)
</p>
</div>
<div id="outline-container-org50e5beb" class="outline-3">
<h3 id="org50e5beb"><span class="section-number-3">1.1.</span> Recurrence</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Definition</b>: Let \(D[i, j]\) be the edit distance between \(A[1..i]\) and \(B[1..j]\)
</p>
<ul class="org-ul">
<li>\(D[0, j] = j\) for all \(j\) (add \(j\) characters)</li>
<li>\(D[i, 0] = i\) for all \(i\) (delete \(i\) characters)</li>
<li>\(D[i, j]\) is the min of:
<ul class="org-ul">
<li>\(D[i-1, j-1]\) if \(A[i] = B[j]\) or \(D[i-1, j-1]\) otherwise</li>
<li>\(D[i-1, j] + 1\) (delete \(A[i]\) and match \(A[1..i-1]\) with \(B[1..j]\))</li>
<li>\(D[i, j-1] + 1\) (add \(B[j]\) and match \(A[1..i]\) with \(B[1..j-1]\))</li>
</ul></li>
</ul>

<p>
The algorithm computes all \(D[i, j]\) using 2 nested loops so runtime \(\Theta(mn)\)
</p>
</div>
</div>
</div>
<div id="outline-container-orgc50e6ed" class="outline-2">
<h2 id="orgc50e6ed"><span class="section-number-2">2.</span> Optimal Binary Search Trees</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Input</b>: integers from 1 to \(n\), probabilities of access \(p_{1}, \dots, p_{n}\) that add to 1
</p>

<p>
<b>Output</b>: an optimal BST with keys from 1 to \(n\), where optimal minimizes
\[
\sum_{i=1}^{n} p_{i} \cdot (\text{depth}(i) + 1)
\]
which is the expected number of tests for a search
</p>

<p>
Optimal static ordering for linked lists and Huffman trees are both built using
greedy algorithms.
</p>

<p>
Greedy algorithm doesn&rsquo;t work for optimal binary search trees.
</p>
</div>
<div id="outline-container-org4331ee8" class="outline-3">
<h3 id="org4331ee8"><span class="section-number-3">2.1.</span> Recurrence</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Definition</b>: define \(M[i, j]\) with \(M[i, j]\) being the minimal cost for items \(\{i, \dots, j\}\)
and \(M[i, j] = 0\) for \(j < i\)
</p>

<p>
<b>Recurrence</b>
\[
M[i,j] = \text{min}_{i \le k \le j} \left(
M[i, k-1] + M[k+1, j]
\right) + \sum_{\ell = i}^{j} p_{\ell}
\]
</p>

<p>
This gives \(M[i, i] = p_{i}\).
</p>
</div>
</div>
<div id="outline-container-org44bacfb" class="outline-3">
<h3 id="org44bacfb"><span class="section-number-3">2.2.</span> Algorithm</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Remark</b>: to get \(\sum_{\ell = i}^{j} p_{\ell}\)
</p>
<ul class="org-ul">
<li>compute \(S[\ell] = p_{1} + \cdots + p_{\ell}\) for \(\ell = 1, \dots, n\)</li>
<li>then \(p_{i} + \cdots + p_{j} = S[j] - S[i-1]\) with \(S[0] = 0\)</li>
</ul>

<div class="org-src-container">
<pre class="src src-python">OptimalBST(p1, ..., pn, S0, ..., Sn):
  <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1</span>, n+<span style="color: #da8548; font-weight: bold;">1</span>):
      <span style="color: #dcaeea;">M</span>[i, i-<span style="color: #da8548; font-weight: bold;">1</span>] = <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #51afef;">for</span> d <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">0</span>, n-<span style="color: #da8548; font-weight: bold;">1</span>):
    <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1</span>, n - d):
        <span style="color: #dcaeea;">j</span> = d - <span style="color: #da8548; font-weight: bold;">1</span>
        <span style="color: #dcaeea;">M</span>[<span style="color: #dcaeea;">i</span>,<span style="color: #dcaeea;">j</span>] = <span style="color: #c678dd;">min</span> <span style="color: #51afef;">for</span> i &lt;= k &lt;= j of (M[i, k-<span style="color: #da8548; font-weight: bold;">1</span>] + M[k+<span style="color: #da8548; font-weight: bold;">1</span>, j]) + S[j] - S[i-<span style="color: #da8548; font-weight: bold;">1</span>]
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org08fc897" class="outline-2">
<h2 id="org08fc897"><span class="section-number-2">3.</span> Independent Sets in Trees</h2>
<div class="outline-text-2" id="text-3">
<p>
An independent set of a graph \(G = (V, E)\) is \(S \subseteq V\) if there are no edges between
elements of \(S\).
</p>

<p>
The maximum independent set problem (for a general graph) has:
</p>
<ul class="org-ul">
<li><b>input</b>: \(G(V, E)\)</li>
<li><b>output</b>: an independent set of maximum cardinality</li>
</ul>
</div>
<div id="outline-container-orgf5dad69" class="outline-3">
<h3 id="orgf5dad69"><span class="section-number-3">3.1.</span> Algorithm</h3>
<div class="outline-text-3" id="text-3-1">
<p>
\(I(v)\) is the size of the largest independent set of the subtree rooted at \(v\)
</p>

<p>
\[
I(v) = \text{max} \left\{ 1 + \sum_{\text{grandchildren $u$ of $v$}} I(u),
\sum_{\text{children $u$ of $v$}} I(u) \right\}
\]
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-11 Mon 23:25</p>
</div>
</body>
</html>
